app/controllers/areas_controller.rb

  def index
    @areas = Area.paginate :page => params[:page], :order => 'nome ASC', :per_page => 10
---
SELECT * FROM `areas` ORDER BY nome ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `areas`

  def show
    @area = Area.find(params[:id])
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 39)

  def create
    @area = Area.new(params[:area])
    if @area.save
---
INSERT INTO `areas` (`created_at`, `nome`, `updated_at`) VALUES('2011-11-29 12:14:37', '', '2011-11-29 12:14:37')

  def edit
    @area = Area.find(params[:id])
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 1)

  def update
    @area = Area.find(params[:id])
    if @area.update_attributes(params[:area])
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 37)
UPDATE `areas` SET `updated_at` = '2011-12-07 17:26:13', `nome` = 'CIÊNCIAS HUMANAS' WHERE `id` = 37

  def destroy
    @area = Area.find(params[:id])
    @area.destroy
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 40)
DELETE FROM `areas` WHERE `id` = 40

def consultaAre
  unless params[:search].present?
    if params[:type_of].to_i == 3
      @contador = Area.all.count
      @areas = Area.paginate :all,:page => params[:page], :order => 'nome ASC', :per_page => 10
---
SELECT count(*) AS count_all FROM `areas` WHERE (nome like '%s%')
SELECT * FROM `areas` WHERE (nome like '%s%') ORDER BY nome ASC LIMIT 0, 10