app/controllers/dicionario_enciclopedias_controller.rb

 def consultaDic
   unless (params[:search].present?) or (params[:search].to_s == "Digite parte da busca")
     if params[:type_of].to_i == 6
       @contador = DicionarioEnciclopedia.all(:include => [:localizacao],:conditions =>["localizacoes.unidade_id = ?",current_user.unidade_id]).count
       @dicionario_enciclopedias = DicionarioEnciclopedia.paginate :all, :page => params[:page], :per_page => 10, :joins => [:identificacao,:localizacao],:conditions =>["localizacoes.unidade_id = ?",current_user.unidade_id],:order => 'livro ASC'
---
SELECT * FROM `identificacaos` ORDER BY livro ASC
SELECT * FROM `localizacoes`
SELECT `dicionario_enciclopedias`.* FROM `dicionario_enciclopedias` INNER JOIN `identificacaos` ON `identificacaos`.id = `dicionario_enciclopedias`.identificacao_id WHERE (livro like '%14%' and tipo ='ENCICLOPÉDIA') ORDER BY livro ASC

  def index
    @dicionario_enciclopedias = DicionarioEnciclopedia.paginate :page => params[:page], :per_page => 10, :joins => :identificacao, :order => 'livro ASC'
---
SELECT * FROM `identificacaos` ORDER BY livro ASC
SELECT `dicionario_enciclopedias`.* FROM `dicionario_enciclopedias` INNER JOIN `identificacaos` ON `identificacaos`.id = `dicionario_enciclopedias`.identificacao_id ORDER BY livro ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `dicionario_enciclopedias` INNER JOIN `identificacaos` ON `identificacaos`.id = `dicionario_enciclopedias`.identificacao_id

  def show
    @dicionario_enciclopedia = DicionarioEnciclopedia.find(params[:id])
---
SELECT * FROM `dicionario_enciclopedias` WHERE (`dicionario_enciclopedias`.`id` = 1)

  def create
    qtd = params[:dicionario_enciclopedia][:qtde].to_i
    if qtd == 0
      qtd = 1
    end
    tombos = params[:dicionario_enciclopedia][:lista_tombos].split(";")
      i = 0
      @livros_cad = []
      qtd.times do
        @dicionario_enciclopedia = DicionarioEnciclopedia.new(params[:dicionario_enciclopedia])
        @dicionario_enciclopedia.identificacao_id = session[:identificacao_id]
        @dicionario_enciclopedia.usuario = current_user.id
        @dicionario_enciclopedia.unidade = current_user.unidade_id
#        Log.gera_log("CRIACAO", "DICIONARIO", current_user.id,@dicionario_enciclopedia.id)
        if params[:dicionario_enciclopedia][:qtde].to_i == 0
          @dicionario_enciclopedia.qtde = 1
        else
          @dicionario_enciclopedia.qtde = params[:dicionario_enciclopedia][:qtde].to_i
        end

        @dicionario_enciclopedia.tombo_l = tombos[i]
        #@livros_cad << @livro.tombo_l
        @dicionario_enciclopedia.save
---
INSERT INTO `dicionario_enciclopedias` (`tipo`, `obs`, `created_at`, `tombo_l`, `colecao`, `updated_at`, `area_id`, `tombo_seduc`, `editora_id`, `volume`, `localizacao_id`, `identificacao_id`, `local_edicao`, `data_edicao`) VALUES('ENCICLOPÉDIA', 'ASDASDASDASD', '2011-12-05 11:12:33', '111', 'ASDAS', '2011-12-05 11:12:33', NULL, NULL, 6, 0, 15, 3, 'ASDASD', '2010-12-05')

  def edit
    @dicionario_enciclopedia = DicionarioEnciclopedia.find(params[:id])
---
SELECT * FROM `dicionario_enciclopedias` WHERE (`dicionario_enciclopedias`.`id` = 3)

  def update
    @dicionario_enciclopedia = DicionarioEnciclopedia.find(params[:id])
    if @dicionario_enciclopedia.update_attributes(params[:dicionario_enciclopedia])
---
SELECT * FROM `dicionario_enciclopedias` WHERE (`dicionario_enciclopedias`.`id` = 9)
UPDATE `dicionario_enciclopedias` SET `updated_at` = '2011-12-07 11:34:31', `tombo_l` = '111' WHERE `id` = 9

  def destroy
    @dicionario_enciclopedia = DicionarioEnciclopedia.find(params[:id])
    @dicionario_enciclopedia.destroy
---
SELECT * FROM `dicionario_enciclopedias` WHERE (`dicionario_enciclopedias`.`id` = 1)
DELETE FROM `dicionario_enciclopedias` WHERE `id` = 1

 def subtitulo
  session[:identificacao] = params[:dicionario_enciclopedia_identificacao_id]
   @identificacao = Identificacao.find_by_id(session[:identificacao]).subtitulo
---
SELECT * FROM `identificacaos` WHERE (`identificacaos`.`id` = '2') LIMIT 1

def filtrar
    if params[:busca].present?
      @identificacoes = Identificacao.all(:conditions =>["livro like ?", params[:busca][:busca]+"%"])
---
SELECT * FROM `identificacaos` WHERE (livro like 'a%')

  def load_resources
    @areas = Area.all(:order => 'nome ASC')
    @editoras = Editora.all(:order => 'nome ASC')
    @localizacoes = Localizacao.all(:order => 'local_guardado ASC')
    @identificacoes  = Identificacao.all(:order => 'livro ASC')
---
SELECT * FROM `areas` ORDER BY nome ASC
SELECT * FROM `editoras` ORDER BY nome ASC
SELECT * FROM `identificacaos` ORDER BY livro ASC