app/controllers/editoras_controller.rb

  def index
    @editoras = Editora.paginate :page => params[:page], :order => 'nome ASC', :per_page => 10
---
SELECT * FROM `editoras` ORDER BY nome ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `editoras`

  def show
    @editora = Editora.find(params[:id])
---
SELECT * FROM `editoras` WHERE (`editoras`.`id` = 10)

  def create
    @editora = Editora.new(params[:editora])
    if @editora.save
---
INSERT INTO `editoras` (`created_at`, `nome`, `updated_at`, `pais`, `cidade`) VALUES('2011-11-29 13:59:24', 'TESTE', '2011-11-29 13:59:24', 'TESTE', 'TESTE')

  def edit
    @editora = Editora.find(params[:id])
---
SELECT * FROM `editoras` WHERE (`editoras`.`id` = 10)

  def destroy
    @editora = Editora.find(params[:id])
    @editora.destroy
---
SELECT * FROM `editoras` WHERE (`editoras`.`id` = 10)
DELETE FROM `editoras` WHERE `id` = 10

def consultaEdi
  unless params[:search].present?
    if params[:type_of].to_i == 3
      @contador = Editora.all.count
      @editoras = Editora.paginate :all,:page => params[:page], :order => 'nome ASC', :per_page => 10
---
SELECT count(*) AS count_all FROM `editoras` WHERE (nome like '%s%')
SELECT * FROM `editoras` WHERE (nome like '%s%') ORDER BY nome ASC LIMIT 0, 10