app/controllers/emprestimos_controller.rb

  def index
    @emprestimos = Emprestimo.all(:conditions => ["unidade_id = ? and data_emprestimo < data_devolucao", current_user.unidade_id])
---
SELECT * FROM `emprestimos`

  def load_resources
    if current_user.unidade_id == 53
      @classes = Aluno.all(:select => "id_classe, classe_descricao, classe_ano, id_escola",:conditions => ["classe_ano = 2011"], :group => ["id_classe,classe_descricao, classe_ano,id_escola"] , :order => "classe_descricao")
      @funcionarios = Aluno.all(:conditions => ["matricula_funcionario is not null"])
    else
      @classes = Aluno.all(:select => "id_classe, classe_descricao, classe_ano, id_escola",:conditions => ["classe_ano = 2011 and id_escola = ?", current_user.unidade.unidades_gpd_id], :group => ["id_classe,classe_descricao, classe_ano,id_escola"] , :order => "classe_descricao")
---
SELECT * FROM `funcionarios` WHERE (unidade_id = 53)
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 53)