app/controllers/funcionarios_controller.rb

SELECT * FROM `funcionarios`
---
  def index
    @funcionarios = Funcionario.all

SELECT * FROM `unidades`
---
  def load_resources
    @unidades = Unidade.all