app/controllers/home_controller.rb

  def index
    @emprestimos = Emprestimo.paginate(:all,:conditions => ["status = 1 and unidade_id = ?",current_user.unidade], :per_page => 15, :page => params[:page], :order => "id Desc")
---
SELECT * FROM `emprestimos` WHERE (unidade_id = 53)
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 53)