app/controllers/identificacaos_controller.rb

SELECT * FROM `identificacaos` ORDER BY livro ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `identificacaos`
---
  def index
    @identificacaos = Identificacao.paginate :page => params[:page], :order => 'livro ASC', :per_page => 10

SELECT * FROM `identificacaos` WHERE (`identificacaos`.`id` = 1)
---
  def show
    @identificacao = Identificacao.find(params[:id])

INSERT INTO `identificacaos` (`obs`, `created_at`, `updated_at`, `livro`, `codigo`, `subtitulo`) VALUES('ASDASDASDASDASD ASD ASD ', '2011-11-29 14:22:13', '2011-11-29 14:22:13', 'TITULO1', 111, 'SUBTITULO1')
---
  def create
    @identificacao = Identificacao.new(params[:identificacao])
    if @identificacao.save

SELECT * FROM `identificacaos` WHERE (`identificacaos`.`id` = 1)
---
  def edit
    @identificacao = Identificacao.find(params[:id])

SELECT * FROM `identificacaos` WHERE (subtitulo like '%le%') ORDER BY livro ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `identificacaos` WHERE (subtitulo like '%le%')
---
def consultaTit
 if (params[:search].nil? || params[:search].empty?)
   $t=01;
    @identificacaos = Identificacao.paginate :page => params[:page], :per_page => 10,  :conditions => ["livro like ? ", ""],:order => 'livro ASC'