app/controllers/importar_controller.rb

SELECT * FROM `temps`
---
  def index
    @import = Temp.all