app/controllers/jogos_controller.rb

  def index
    @jogos = Jogo.paginate :page => params[:page], :order => 'nome ASC', :per_page => 10
---
SELECT * FROM `jogos` ORDER BY nome ASC LIMIT 0, 10

  def show
    @jogos = Jogo.find(params[:id])
---
SELECT * FROM `jogos` WHERE (`jogos`.`id` = 1)

  def create
    @jogos = Jogo.new(params[:jogo])
    if @jogos.save
---
INSERT INTO `jogos` (`tipo`, `obs`, `created_at`, `faixa_etaria`, `tombo_l`, `nome`, `updated_at`, `tombo_seduc`, `fabricante`, `localizacao_id`) VALUES('ASDASD', 'DSADSA', '2011-12-02 12:59:17', '14_OU_MAIS', '111', 'ASDASD', '2011-12-02 12:59:17', NULL, 'ASDASD', 1)

  def edit
    @jogos = Jogo.find(params[:id])
---
SELECT * FROM `jogos` WHERE (`jogos`.`id` = 1)

  def destroy
    @jogos = Jogo.find(params[:id])
    @jogos.destroy
---
SELECT * FROM `jogos` WHERE (`jogos`.`id` = 13)
DELETE FROM `jogos` WHERE `id` = 13

def consultaJog
 unless params[:search].present?
   if params[:type_of].to_i == 3
     @jogos = Jogo.paginate :all, :page => params[:page], :per_page => 10,:order => 'nome ASC'
---
SELECT * FROM `jogos` WHERE (faixa_etaria like '%3%' ) ORDER BY nome ASC LIMIT 0, 10