app/controllers/livros_controller.rb

SELECT * FROM `identificacaos` ORDER BY livro ASC
SELECT `livros`.* FROM `livros` INNER JOIN `identificacaos` ON `identificacaos`.id = `livros`.identificacao_id ORDER BY livro ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `livros` INNER JOIN `identificacaos` ON `identificacaos`.id = `livros`.identificacao_id
---
  def index

       @contador = Livro.all.count
       @livros = Livro.paginate :all, :page => params[:page], :per_page => 50, :joins => :identificacao,:order => 'livro ASC'

SELECT * FROM `livros` WHERE (`livros`.`id` = 5)
---
  def show
    @livro = Livro.find(params[:id])

INSERT INTO `livros` (`obs`, `created_at`, `tombo_l`, `colecao`, `updated_at`, `area_id`, `tombo_seduc`, `resumo`, `editora_id`, `identificacao_id`, `localizacao_id`, `local_edicao`, `data_edicao`, `edicao`, `status`) VALUES('ASDASDASD', '2011-12-06 13:10:06', '111', 'SSSS', '2011-12-06 13:10:06', 34, 1, 'ASDASD', 5, 5, 18, 'ASDASDASD', '2011-12-06', '1', 1)
---
  def create
    qtd = params[:livro][:qtde_livros].to_i
    if qtd == 0
      qtd = 1
    end
    tombos = params[:livro][:lista_tombos].split(";")
      i = 0
      @livros_cad = []
      qtd.times do
        @livro = Livro.new(params[:livro])
        #Log.gera_log("CRIACAO", "LIVROS", current_user.id,@livro.id)
        @livro.identificacao_id = session[:identificacao_id]
        @livro.usuario = current_user.id
        @livro.unidade = current_user.unidade_id
        if params[:livro][:qtde_livros].to_i == 0
          @livro.qtde_livros = 1
        else
          @livro.qtde_livros = params[:livro][:qtde_livros].to_i
        end

        @livro.tombo_l = tombos[i]
        #@livros_cad << @livro.tombo_l
        @livro.save

SELECT * FROM `livros` WHERE (`livros`.`id` = 4)
---
  def edit
    @livro = Livro.find(params[:id])

SELECT * FROM `identificacaos` ORDER BY livro ASC
SELECT * FROM `localizacoes` WHERE (unidade_id = 53)
SELECT `livros`.* FROM `livros` INNER JOIN `assuntos_livros` ON `assuntos_livros`.livro_id = `livros`.id INNER JOIN `assuntos` ON `assuntos`.id = `assuntos_livros`.assunto_id WHERE (descricao like '%ass%' ) ORDER BY descricao ASC LIMIT 0, 10
SELECT * FROM `areas` ORDER BY nome ASC
SELECT * FROM `autores`
SELECT * FROM `assuntos` LIMIT 1
---
def consultaLiv
   unless params[:search].present?
     if params[:type_of].to_i == 7
       @contador = Livro.all(:include => [:localizacao],:conditions => ["localizacoes.unidade_id = ?", current_user.unidade_id]).count
       @livros = Livro.paginate(:all, :include => [:identificacao,:localizacao],:conditions => ["localizacoes.unidade_id = ?", current_user.unidade_id], :page => params[:page], :per_page => 50,:order => 'livro ASC')
       render :update do |page|
         page.replace_html 'livros', :partial => "livros"
       end
     end
   else
      if params[:type_of].to_i == 1
          @contador = Livro.all(:include => [:identificacao, :localizacao], :conditions => ["identificacaos.livro like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%", current_user.unidade_id]).count
          @livros = Livro.paginate( :all,:page => params[:page], :per_page => 50, :include => [:identificacao, :localizacao],  :conditions => ["identificacaos.livro like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%", current_user.unidade_id],:order => 'livro ASC')
          render :update do |page|
            page.replace_html 'livros', :partial => "livros"
          end
          else if params[:type_of].to_i == 2
            @contador = Livro.all(:include => [:area,:localizacao], :conditions => ["areas.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id]).count
            @livros = Livro.paginate :all, :page => params[:page], :per_page => 50, :include => [:area,:localizacao],  :conditions => ["areas.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id],:order => 'nome ASC'
            render :update do |page|
              page.replace_html 'livros', :partial => "livros"
            end
            else if params[:type_of].to_i == 3
              @contador = Livro.all(:include => [:autores,:localizacao], :conditions => ["autores.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id]).count
              @livros = Livro.paginate :all, :page => params[:page], :per_page => 50, :include => [:autores,:localizacao],  :conditions => ["autores.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id],:order => 'nome ASC'
              render :update do |page|
                page.replace_html 'livros', :partial => "livros"
              end
              else if params[:type_of].to_i == 4
                @contador = Livro.all(:include => [:assuntos,:localizacao], :conditions => ["assuntos.descricao like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id]).count
                @livros = Livro.paginate(:all, :page => params[:page], :per_page => 50, :include => [:localizacao,:assuntos],  :conditions => ["assuntos.descricao like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id],:order => 'descricao ASC')

SELECT * FROM `editoras` ORDER BY nome ASC
---
                end
                else if params[:type_of].to_i == 5
                  @contador = Livro.all(:include => [:editora,:localizacao], :conditions => ["editoras.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id]).count
                  @livros = Livro.paginate(:all, :page => params[:page], :per_page => 50, :include => [:editora,:localizacao],  :conditions => ["editoras.nome like ? and localizacoes.unidade_id = ?", "%" + params[:search].to_s + "%",current_user.unidade_id],:order => 'nome ASC')

SELECT * FROM `identificacaos` WHERE (livro like 'asd%')
---
  def filtrar
    if params[:busca].present?
      @identificacoes = Identificacao.all(:conditions =>["livro like ?", params[:busca][:busca]+"%"])

INSERT INTO `assuntos` (`created_at`, `updated_at`, `descricao`) VALUES('2011-12-02 11:32:55', '2011-12-02 11:32:55', 'TESTE')
SELECT * FROM `assuntos`
---
  def create_assunto
    @assunto = Assunto.new(params[:assunto])
    if @assunto.save
      @assuntos = Assunto.all

SELECT * FROM `identificacaos` WHERE (`identificacaos`.`id` = '1') LIMIT 1
---
 def subtitulo
  session[:identificacao] = params[:livro_identificacao_id]
   #@identificacao = Identificacao.find(:all, :conditions => ["id=?", session[:identificacao]])
   @identificacao = Identificacao.find_by_id(session[:identificacao]).subtitulo

SELECT * FROM `assuntos`
SELECT * FROM `identificacaos` ORDER BY livro ASC
SELECT * FROM `areas` ORDER BY nome ASC
SELECT * FROM `editoras` ORDER BY nome ASC
---
  def load_resources
    @assuntos = Assunto.all(:order => "descricao ASC")
    @identificacoes  = Identificacao.all(:order => 'livro ASC')
    @autores  = Autor.all(:order => "nome ASC")
    @areas = Area.all(:order => 'nome ASC')
    @editoras = Editora.all(:order => 'nome ASC')