app/controllers/mapas_controller.rb

SELECT * FROM `mapas` ORDER BY titulo ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `mapas`
---
  def index
    @mapas = Mapas.paginate :page => params[:page], :order => 'titulo ASC', :per_page => 10