app/controllers/mapas_controller.rb

  def show
    @mapas = Mapa.find(params[:id])
---
SELECT * FROM `mapas` WHERE (`mapas`.`id` = 1)

  def create
    @mapas = Mapa.new(params[:mapa])
    @mapas.usuario = current_user.id
    @mapas.unidade = current_user.unidade_id
    Log.gera_log("CRIACAO", "MAPAS", current_user.id,@mapas.id)
    if @mapas.save
---
INSERT INTO `mapas` (`tipo`, `obs`, `created_at`, `ano`, `formato`, `tombo_l`, `updated_at`, `titulo`, `tombo_seduc`, `subtitulo`, `editora_id`, `localizacao_id`, `local_edicao`, `data_edicao`, `edicao`) VALUES('BIOGRÁFICO', 'SADASDAS', '2011-12-02 16:00:01', '2011-12-02', 'PLANO', '123', '2011-12-02 16:00:01', '12313123123123', NULL, '1231312313', 6, NULL, '123312321231', NULL, '1')

  def edit
    @mapas = Mapa.find(params[:id])
---
SELECT * FROM `mapas` WHERE (`mapas`.`id` = 1)

  def update
    @mapas = Mapa.find(params[:id])
    if @mapas.update_attributes(params[:mapa])
---
SELECT * FROM `mapas` WHERE (`mapas`.`id` = 1)
UPDATE `mapas` SET `updated_at` = '2011-12-06 12:52:33', `tombo_l` = '', `obs` = '', `edicao` = '', `local_edicao` = '', `subtitulo` = '', `titulo` = 'POLÍTICO', `ano` = '2011-12-06' WHERE `id` = 54

  def destroy
    @mapas = Mapa.find(params[:id])
    @mapas.destroy
---
SELECT * FROM `mapas` WHERE (`mapas`.`id` = 55)
DELETE FROM `mapas` WHERE `id` = 55

def consultaMap
 unless params[:search].present?
   if params[:type_of].to_i == 3
     @contador = Mapa.all(:include => [:localizacao],:conditions => ["unidade_id = ?", current_user.unidade_id]).count
     @mapas = Mapa.paginate :all,:include => [:localizacao],:conditions => ["localizacoes.unidade_id = ?",current_user.unidade_id], :page => params[:page], :per_page => 10,:order => 'titulo ASC'
---
SELECT count(*) AS count_all FROM `mapas`
SELECT * FROM `localizacoes`
SELECT * FROM `mapas` WHERE (subtitulo like '%ameri%' ) ORDER BY subtitulo ASC LIMIT 0, 10

  def load_resources
    @editoras = Editora.all(:order => 'nome ASC')
---
SELECT * FROM `editoras` ORDER BY nome ASC