app/controllers/passwords_controller.rb

  def create
  return unless request.post?
  if @user = User.find_for_forget(params[:email])
      @user.forgot_password
      ChamadoMailer.deliver_forgot_password(@user)
      @user.save
---
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'corujao83@hotmail.com' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-11-25 13:33:13', `password_reset_code` = '5b02e7c2e2d5b4cc30168d2274cb1fa9de3f3952' WHERE `id` = 2

  def edit
    if params[:id].nil?
      render :action => 'new'
      return
    end
    @user = User.find_by_password_reset_code(params[:id]) if params[:id]
---
SELECT * FROM `users` WHERE (`users`.`password_reset_code` = '2f518cd276a69fa3dd63bb09d9103a32f89c9f64') LIMIT 1

  def atualiza
    if params[:id].nil?
      render :action => 'new'
      return
    end
    if params[:password].blank?
      flash[:notice] = "O campo Senha não pode estar em branco."
      render :action => 'edit', :id => params[:id]
      return
    end
    @user = User.find_by_password_reset_code(params[:id]) if params[:id]
    raise if @user.nil?
    return if @user unless params[:password]
      if (params[:password] == params[:password_confirmation])
      #Uncomment and comment lines with @user to have the user logged in after reset - not recommended
        #self.current_user = @user #for the next two lines to work
        #current_user.password_confirmation = params[:password_confirmation]
        #current_user.password = params[:password]
        #@user.reset_password
    #flash[:notice] = current_user.save ? "Password reset" : "Password not reset"
    @user.password_confirmation = params[:password_confirmation]
    @user.password = params[:password]
    @user.reset_password
    flash[:notice] = @user.save ? "Senha alterada." : "Password not reset."
---
SELECT * FROM `users` WHERE (`users`.`password_reset_code` = '33851315c2e6d33f7be3e4eadbd800cb97db5ecc') LIMIT 1
UPDATE `users` SET `updated_at` = '2011-11-25 15:39:28', `password_reset_code` = NULL, `crypted_password` = '3adebe8ad8d9da48fc2c94cafb2ccb69c09519b8' WHERE `id` = 2