app/controllers/periodicos_controller.rb

SELECT * FROM `periodicos` ORDER BY titulo ASC LIMIT 0, 4
SELECT count(*) AS count_all FROM `periodicos`
---
  def index
    @periodicos = Periodico.paginate :page => params[:page], :order => 'titulo ASC', :per_page => 10

SELECT * FROM `periodicos` WHERE (`periodicos`.`id` = 1)
---
  def show
    @periodicos = Periodico.find(params[:id])

INSERT INTO `periodicos` (`tipo`, `obs`, `created_at`, `tombo_l`, `titulo`, `colecao`, `updated_at`, `tombo_seduc`, `subtitulo`, `periodicidade`, `localizacao_id`, `issn`, `data_producao`, `local_producao`, `producao`) VALUES('ANUARIO', 'SDADSADASDSA', '2011-12-05 13:19:11', '123', 'DSDSADSSDSDAASDDSA', 'SDADSADSASDA', '2011-12-05 13:19:11', NULL, 'DSADSDSDSSDA', 'SEMANAL', NULL, NULL, '2011-12-05', 'DASSADSDSDA', 'SDADSADSADS')
---
  def create
    @periodicos = Periodico.new(params[:periodico])
    @periodicos.usuario = current_user.id
    @periodicos.unidade = current_user.unidade_id
    Log.gera_log("CRIACAO", "PERIODICOS", current_user.id,@periodicos.id)
    if @periodicos.save

SELECT * FROM `periodicos` WHERE (`periodicos`.`id` = 3)
---
  def edit
    @periodicos = Periodico.find(params[:id])

SELECT * FROM `periodicos` WHERE (`periodicos`.`id` = 3)
UPDATE `periodicos` SET `updated_at` = '2011-12-06 12:27:19', `localizacao_id` = NULL, `subtitulo` = 'NOTICIA DA REGIãO' WHERE `id` = 11
---
  def update
    @periodicos = Periodico.find(params[:id])
    if @periodicos.update_attributes(params[:periodico])

SELECT * FROM `periodicos` WHERE (`periodicos`.`id` = 1)
DELETE FROM `periodicos` WHERE `id` = 1
---
  def destroy
    @periodicos = Periodico.find(params[:id])
    @periodicos.destroy

SELECT * FROM `periodicos` WHERE (titulo like '%jo%' and periodicidade ='DIARIO') ORDER BY titulo ASC LIMIT 0, 10
---
def consultaPer
 if (params[:search].nil? || params[:search].empty?)
   $t=01;
    #@periodicos = Periodico.paginate :page => params[:page], :order => 'titulo ASC', :per_page => 10
    @periodicos = Periodico.paginate :page => params[:page], :per_page => 10, :conditions => ["titulo like ? ", ""],:order => 'titulo ASC'