app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'teste') LIMIT 1
---
  def load_users
    @users =User.find(:all, :order => 'login ASC')

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `password_reset_code`, `activation_code`, `unidade_id`, `remember_token`, `login`, `email`) VALUES('', '70ce5edf443848a049bcb59b94e76aa2b010178b', '2011-11-25 14:12:37', NULL, 'fd1df54e72f7c643a47391b81f63fbfe856fdc94', NULL, '2011-11-25 14:12:37', NULL, '78c1b8c680320cd5fddcd08f0c2bc2a28ba22063', NULL, NULL, 'pohaloka', 'alexandre@seducpma.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `unidades`
---
  def load_resources
    @unidades = Unidade.all